lock.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-18 六 12:41 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>分布式锁总结</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="./css/org-css.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">分布式锁总结</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6190e75">1. 前言</a></li>
<li><a href="#orgd987e4a">2. redis实现</a>
<ul>
<li><a href="#org920ef20">2.1. 版本一:</a></li>
<li><a href="#orgc474527">2.2. 版本二:</a></li>
<li><a href="#org9dfe1d8">2.3. 版本三:</a></li>
</ul>
</li>
<li><a href="#orgf4107cf">3. consul 实现</a></li>
<li><a href="#org0d90581">4. 参考资料</a></li>
</ul>
</div>
</div>

<div id="outline-container-org6190e75" class="outline-2">
<h2 id="org6190e75"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
在微服务架构中，由于服务是多机部署的，所以常常需要分布式锁来进行互斥操作。比如一些服务中小的定时任务，是随服务一起启动的，但是由于多机部署，如果不做处理，会同时有多个进程在处理，会有一些麻烦。在之前我一般使用的redis来维护这样一个状态。但是之前看到公司大佬有用到consul来实现（原来consul api已经自带了）, 所以总结下相关内容。对于分布式锁的实现需要满足以下一些条件:
</p>
<ol class="org-ol">
<li>同时只有一个client可以获取一个锁。</li>
<li>client异常退出不会影响锁的释放。</li>
<li>锁只能由获取锁的client释放。</li>
</ol>
<p>
要满足条件一，需要一个标志位，而且标志位的操作必须是原子的。要满足条件二, 得给锁一个占用时间，过期自动释放。要满足条件三，client端能检测标志位是否由自己设置。
</p>
</div>
</div>
<div id="outline-container-orgd987e4a" class="outline-2">
<h2 id="orgd987e4a"><span class="section-number-2">2</span> redis实现</h2>
<div class="outline-text-2" id="text-2">
<p>
由于redis是在后台服务中用的比较多的一个组件，所以很多情况下可以使用redis来实现分布式锁是很方便的。
</p>
</div>
<div id="outline-container-org920ef20" class="outline-3">
<h3 id="org920ef20"><span class="section-number-3">2.1</span> 版本一:</h3>
<div class="outline-text-3" id="text-2-1">
<p>
lock: 通过SET KEY VALUE NX 来获取锁
</p>

<p>
unlock: 通过DEL KEY 来释放锁
</p>

<p>
通过设置NX标志保证唯一性。但是这样有个问题，就是没有满足条件二。如果释放锁失败了(client crash了或者网络出现了问题)，key就会一直在redis中。之后的client就不能再获取了。所以为了能够自动释放需要加上超时设置。
</p>
</div>
</div>
<div id="outline-container-orgc474527" class="outline-3">
<h3 id="orgc474527"><span class="section-number-3">2.2</span> 版本二:</h3>
<div class="outline-text-3" id="text-2-2">
<p>
lock: SET KEY VALUE NX PX 3000
</p>

<p>
unlock: DEL KEY
这个时候其实还是没有完美解决锁超时的问题，比如：获取锁的服务需要的锁的时间比你设置key的过期时间还要长，这时候锁就被自动释放就有可能被其他client获取到。通常做法是开一个goroutine或者线程在要过期的时候刷新锁的过期时间。
</p>

<p>
extern: SET KEY VALUE PX 3000
但是这里又出现了一个小问题，extern这个操作并不知道是谁设置了这个锁, 有可能锁过期了，还傻乎乎的以为自己占用了锁，一直延长锁的过期时间。也就是没满足条件三，client只能操作自己获取的锁。而且这里unlock操作也没有判断是否是自己的锁。如果使用方操作不当的话很容易删掉别人的key。所以这两个地方需要加上check，只有在是自己的锁的情况下才能操作，这里可以利用VALUE来存储当前占有锁是哪个client。所以需要一个clientid。还有需要注意的地方就是check跟unlock，check跟extern的操作是原子的，不然一切都没了意义，一般情况下使用redis lua脚本来实现，由于redis是单线程，所以能保证原子性。
</p>
</div>
</div>
<div id="outline-container-org9dfe1d8" class="outline-3">
<h3 id="org9dfe1d8"><span class="section-number-3">2.3</span> 版本三:</h3>
<div class="outline-text-3" id="text-2-3">
<p>
lock: SET KEY VALUE NX PX 3000
</p>

<p>
unlock:
</p>
<div class="org-src-container">
<pre class="src src-lua"> <span style="color: #d75f5f;">if</span> redis.call<span style="color: #008787;">(</span><span style="color: #afaf00;">"get"</span>,KEYS<span style="color: #d75f87;">[</span><span style="color: #d787af;">1</span><span style="color: #d75f87;">]</span><span style="color: #008787;">)</span> == ARGV<span style="color: #008787;">[</span><span style="color: #d787af;">1</span><span style="color: #008787;">]</span> <span style="color: #d75f5f;">then</span>
    <span style="color: #d75f5f;">return</span> redis.call<span style="color: #008787;">(</span><span style="color: #afaf00;">"del"</span>,KEYS<span style="color: #d75f87;">[</span><span style="color: #d787af;">1</span><span style="color: #d75f87;">]</span><span style="color: #008787;">)</span>
<span style="color: #d75f5f;">else</span>
    <span style="color: #d75f5f;">return</span> <span style="color: #d787af;">0</span>
<span style="color: #d75f5f;">end</span> 
</pre>
</div>
<p>
extern:
</p>
<div class="org-src-container">
<pre class="src src-lua"><span style="color: #d75f5f;">if</span> redis.call<span style="color: #008787;">(</span><span style="color: #afaf00;">"GET"</span>, KEYS<span style="color: #d75f87;">[</span><span style="color: #d787af;">1</span><span style="color: #d75f87;">]</span><span style="color: #008787;">)</span> == ARGV<span style="color: #008787;">[</span><span style="color: #d787af;">1</span><span style="color: #008787;">]</span> <span style="color: #d75f5f;">then</span>
  <span style="color: #d75f5f;">return</span> redis.call<span style="color: #008787;">(</span><span style="color: #afaf00;">"SET"</span>, KEYS<span style="color: #d75f87;">[</span><span style="color: #d787af;">1</span><span style="color: #d75f87;">]</span>, ARGV<span style="color: #d75f87;">[</span><span style="color: #d787af;">1</span><span style="color: #d75f87;">]</span>, <span style="color: #afaf00;">"XX"</span>, <span style="color: #afaf00;">"PX"</span>, ARGV<span style="color: #d75f87;">[</span><span style="color: #d787af;">2</span><span style="color: #d75f87;">]</span><span style="color: #008787;">)</span>
<span style="color: #d75f5f;">else</span>
  <span style="color: #d75f5f;">return</span> <span style="color: #d787af;">0</span>
<span style="color: #d75f5f;">end</span>
</pre>
</div>

<p>
版本三就是一个可以在通常情况下使用的分布式锁了。但是还有点小问题，如果redis crash了咋办？这里我们只使用了一个redis。而redis集群是异步同步，有可能丢失数据，也有可能存在时间差，在这种情况下都有可能被其他client获取到lock。当然redis官方提供了一个redlock的算法，利用多台redis master, 每次lock，unlock，extern都需要大多是redis节点操作成功才算成功，复杂度也提升了很多，可以参考这里的实现:<a href="https://github.com/go-redsync/redsync">https://github.com/go-redsync/redsync</a>。
还有要注意的地方就是最好操作实现幂等性，防止锁出现未知问题。
</p>
</div>
</div>
</div>

<div id="outline-container-orgf4107cf" class="outline-2">
<h2 id="orgf4107cf"><span class="section-number-2">3</span> consul 实现</h2>
<div class="outline-text-2" id="text-3">
<p>
对于consul来说，需要关注的点是一样的。只不过在consul有不同的抽象。consul中使用kv跟session来实现。session用来标识是哪个client获取了lock。consul比较好的一点是它是强一致的集群。consul服务的稳定性有保证。
参考官方文档: <a href="https://www.consul.io/docs/guides/leader-election.html">https://www.consul.io/docs/guides/leader-election.html</a>
在官方的sdk中已经实现了一个可以直接使用的分布式锁，操作如下:
lock:
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #d75f5f;">func</span> <span style="color: #008787;">(</span>l *<span style="color: #d787af;">Lock</span><span style="color: #008787;">)</span> <span style="color: #ffaf00;">Lock</span><span style="color: #008787;">(</span>stopCh &lt;-<span style="color: #d75f5f;">chan</span> <span style="color: #d75f5f;">struct</span><span style="color: #d75f87;">{}</span><span style="color: #008787;">)</span> <span style="color: #008787;">(</span>&lt;-<span style="color: #d75f5f;">chan</span> <span style="color: #d75f5f;">struct</span><span style="color: #d75f87;">{}</span>, error<span style="color: #008787;">)</span> <span style="color: #008787;">{</span>
  <span style="color: #767676;">// </span><span style="color: #767676;">Hold the lock as we try to acquire</span>
  l.l.<span style="color: #ffaf00;">Lock</span><span style="color: #d75f87;">()</span>
  <span style="color: #d75f5f;">defer</span> l.l.<span style="color: #ffaf00;">Unlock</span><span style="color: #d75f87;">()</span>

  <span style="color: #767676;">// </span><span style="color: #767676;">Check if we already hold the lock</span>
  <span style="color: #d75f5f;">if</span> l.isHeld <span style="color: #d75f87;">{</span>
    <span style="color: #d75f5f;">return</span> <span style="color: #d787af;">nil</span>, ErrLockHeld
  <span style="color: #d75f87;">}</span>

  <span style="color: #767676;">// </span><span style="color: #767676;">Check if we need to create a session first</span>
  <span style="color: #767676;">// </span><span style="color: #767676;">&#22914;&#26524;&#27809;&#26377;session&#65292;&#21019;&#24314;&#19968;&#20010;&#65292;&#29992;&#20110;&#26631;&#35782;&#33719;&#21462;&#38145;&#30340;&#23545;&#35937;&#21644;&#36807;&#26399;&#31649;&#29702;</span>
  l.lockSession = l.opts.Session
  <span style="color: #d75f5f;">if</span> l.lockSession == <span style="color: #afaf00;">""</span> <span style="color: #d75f87;">{</span>
    s, err := l.<span style="color: #ffaf00;">createSession</span><span style="color: #87af87;">()</span>
    <span style="color: #d75f5f;">if</span> err != <span style="color: #d787af;">nil</span> <span style="color: #87af87;">{</span>
      <span style="color: #d75f5f;">return</span> <span style="color: #d787af;">nil</span>, fmt.<span style="color: #ffaf00;">Errorf</span><span style="color: #d75f00;">(</span><span style="color: #afaf00;">"failed to create session: %v"</span>, err<span style="color: #d75f00;">)</span>
    <span style="color: #87af87;">}</span>

    l.sessionRenew = <span style="color: #ff8700;">make</span><span style="color: #87af87;">(</span><span style="color: #d75f5f;">chan</span> <span style="color: #d75f5f;">struct</span><span style="color: #d75f00;">{}</span><span style="color: #87af87;">)</span>
    l.lockSession = s
    session := l.c.<span style="color: #ffaf00;">Session</span><span style="color: #87af87;">()</span>
    <span style="color: #767676;">// </span><span style="color: #767676;">&#22312;&#27809;&#37322;&#25918;&#38145;&#20043;&#21069;&#19968;&#30452;&#21047;&#26032;session&#30340;&#26102;&#38388;</span>
    <span style="color: #d75f5f;">go</span> session.<span style="color: #ffaf00;">RenewPeriodic</span><span style="color: #87af87;">(</span>l.opts.SessionTTL, s, <span style="color: #d787af;">nil</span>, l.sessionRenew<span style="color: #87af87;">)</span>

    <span style="color: #767676;">// </span><span style="color: #767676;">If we fail to acquire the lock, cleanup the session</span>
    <span style="color: #d75f5f;">defer</span> <span style="color: #d75f5f;">func</span><span style="color: #87af87;">()</span> <span style="color: #87af87;">{</span>
      <span style="color: #d75f5f;">if</span> !l.isHeld <span style="color: #d75f00;">{</span>
        <span style="color: #ff8700;">close</span><span style="color: #008787;">(</span>l.sessionRenew<span style="color: #008787;">)</span>
        l.sessionRenew = <span style="color: #d787af;">nil</span>
      <span style="color: #d75f00;">}</span>
    <span style="color: #87af87;">}()</span>
  <span style="color: #d75f87;">}</span>

  <span style="color: #767676;">// </span><span style="color: #767676;">Setup the query options</span>
  kv := l.c.<span style="color: #ffaf00;">KV</span><span style="color: #d75f87;">()</span>
  qOpts := &amp;<span style="color: #d787af;">QueryOptions</span><span style="color: #d75f87;">{</span>
    <span style="color: #d787af;">WaitTime</span>: l.opts.LockWaitTime,
  <span style="color: #d75f87;">}</span>

  start := time.<span style="color: #ffaf00;">Now</span><span style="color: #d75f87;">()</span>
  attempts := <span style="color: #d787af;">0</span>
<span style="color: #d787af;">WAIT</span>:
  <span style="color: #767676;">// </span><span style="color: #767676;">Check if we should quit</span>
  <span style="color: #d75f5f;">select</span> <span style="color: #d75f87;">{</span>
  <span style="color: #d75f5f;">case</span> &lt;-stopCh:
    <span style="color: #d75f5f;">return</span> <span style="color: #d787af;">nil</span>, <span style="color: #d787af;">nil</span>
  <span style="color: #d75f5f;">default</span>:
  <span style="color: #d75f87;">}</span>

  <span style="color: #767676;">// </span><span style="color: #767676;">Handle the one-shot mode.</span>
  <span style="color: #d75f5f;">if</span> l.opts.LockTryOnce &amp;&amp; attempts &gt; <span style="color: #d787af;">0</span> <span style="color: #d75f87;">{</span>
    elapsed := time.<span style="color: #ffaf00;">Since</span><span style="color: #87af87;">(</span>start<span style="color: #87af87;">)</span>
    <span style="color: #d75f5f;">if</span> elapsed &gt; qOpts.WaitTime <span style="color: #87af87;">{</span>
      <span style="color: #d75f5f;">return</span> <span style="color: #d787af;">nil</span>, <span style="color: #d787af;">nil</span>
    <span style="color: #87af87;">}</span>

    qOpts.WaitTime -= elapsed
  <span style="color: #d75f87;">}</span>
  attempts++

  <span style="color: #767676;">// </span><span style="color: #767676;">Look for an existing lock, blocking until not taken</span>
  pair, meta, err := kv.<span style="color: #ffaf00;">Get</span><span style="color: #d75f87;">(</span>l.opts.Key, qOpts<span style="color: #d75f87;">)</span>
  <span style="color: #d75f5f;">if</span> err != <span style="color: #d787af;">nil</span> <span style="color: #d75f87;">{</span>
    <span style="color: #d75f5f;">return</span> <span style="color: #d787af;">nil</span>, fmt.<span style="color: #ffaf00;">Errorf</span><span style="color: #87af87;">(</span><span style="color: #afaf00;">"failed to read lock: %v"</span>, err<span style="color: #87af87;">)</span>
  <span style="color: #d75f87;">}</span>
  <span style="color: #d75f5f;">if</span> pair != <span style="color: #d787af;">nil</span> &amp;&amp; pair.Flags != LockFlagValue <span style="color: #d75f87;">{</span>
    <span style="color: #d75f5f;">return</span> <span style="color: #d787af;">nil</span>, ErrLockConflict
  <span style="color: #d75f87;">}</span>
  locked := <span style="color: #d787af;">false</span>
  <span style="color: #d75f5f;">if</span> pair != <span style="color: #d787af;">nil</span> &amp;&amp; pair.Session == l.lockSession <span style="color: #d75f87;">{</span>
    <span style="color: #d75f5f;">goto</span> <span style="color: #d787af;">HELD</span>
  <span style="color: #d75f87;">}</span>
  <span style="color: #d75f5f;">if</span> pair != <span style="color: #d787af;">nil</span> &amp;&amp; pair.Session != <span style="color: #afaf00;">""</span> <span style="color: #d75f87;">{</span>
    qOpts.WaitIndex = meta.LastIndex
    <span style="color: #d75f5f;">goto</span> <span style="color: #d787af;">WAIT</span>
  <span style="color: #d75f87;">}</span>

  <span style="color: #767676;">//</span><span style="color: #767676;">&#33719;&#21462;&#19968;&#20010;lock</span>
  pair = l.<span style="color: #ffaf00;">lockEntry</span><span style="color: #d75f87;">(</span>l.lockSession<span style="color: #d75f87;">)</span>
  locked, _, err = kv.<span style="color: #ffaf00;">Acquire</span><span style="color: #d75f87;">(</span>pair, <span style="color: #d787af;">nil</span><span style="color: #d75f87;">)</span>
  <span style="color: #d75f5f;">if</span> err != <span style="color: #d787af;">nil</span> <span style="color: #d75f87;">{</span>
    <span style="color: #d75f5f;">return</span> <span style="color: #d787af;">nil</span>, fmt.<span style="color: #ffaf00;">Errorf</span><span style="color: #87af87;">(</span><span style="color: #afaf00;">"failed to acquire lock: %v"</span>, err<span style="color: #87af87;">)</span>
  <span style="color: #d75f87;">}</span>

  <span style="color: #767676;">// </span><span style="color: #767676;">Handle the case of not getting the lock</span>
  <span style="color: #d75f5f;">if</span> !locked <span style="color: #d75f87;">{</span>
    <span style="color: #767676;">// </span><span style="color: #767676;">Determine why the lock failed</span>
    qOpts.WaitIndex = <span style="color: #d787af;">0</span>
    pair, meta, err = kv.<span style="color: #ffaf00;">Get</span><span style="color: #87af87;">(</span>l.opts.Key, qOpts<span style="color: #87af87;">)</span>
    <span style="color: #d75f5f;">if</span> pair != <span style="color: #d787af;">nil</span> &amp;&amp; pair.Session != <span style="color: #afaf00;">""</span> <span style="color: #87af87;">{</span>
      <span style="color: #767676;">//</span><span style="color: #767676;">If the session is not null, this means that a wait can safely happen</span>
      <span style="color: #767676;">//</span><span style="color: #767676;">using a long poll</span>
      qOpts.WaitIndex = meta.LastIndex
      <span style="color: #d75f5f;">goto</span> <span style="color: #d787af;">WAIT</span>
    <span style="color: #87af87;">}</span> <span style="color: #d75f5f;">else</span> <span style="color: #87af87;">{</span>
      <span style="color: #767676;">// </span><span style="color: #767676;">If the session is empty and the lock failed to acquire, then it means</span>
      <span style="color: #767676;">// </span><span style="color: #767676;">a lock-delay is in effect and a timed wait must be used</span>
      <span style="color: #d75f5f;">select</span> <span style="color: #d75f00;">{</span>
      <span style="color: #d75f5f;">case</span> &lt;-time.<span style="color: #ffaf00;">After</span><span style="color: #008787;">(</span>DefaultLockRetryTime<span style="color: #008787;">)</span>:
        <span style="color: #d75f5f;">goto</span> <span style="color: #d787af;">WAIT</span>
      <span style="color: #d75f5f;">case</span> &lt;-stopCh:
        <span style="color: #d75f5f;">return</span> <span style="color: #d787af;">nil</span>, <span style="color: #d787af;">nil</span>
      <span style="color: #d75f00;">}</span>
    <span style="color: #87af87;">}</span>
  <span style="color: #d75f87;">}</span>

<span style="color: #d787af;">HELD</span>:
  <span style="color: #767676;">// </span><span style="color: #767676;">Watch to ensure we maintain leadership</span>
  leaderCh := <span style="color: #ff8700;">make</span><span style="color: #d75f87;">(</span><span style="color: #d75f5f;">chan</span> <span style="color: #d75f5f;">struct</span><span style="color: #87af87;">{}</span><span style="color: #d75f87;">)</span>
  <span style="color: #767676;">//</span><span style="color: #767676;">&#19968;&#30452;&#30417;&#35270;&#38145;&#30340;&#21344;&#29992;&#32773;&#65292;&#24403;&#38145;&#30340;&#21344;&#29992;&#32773;&#19981;&#26159;&#24403;&#21069;session&#65292;close&#25481;leaderCh</span>
  <span style="color: #d75f5f;">go</span> l.<span style="color: #ffaf00;">monitorLock</span><span style="color: #d75f87;">(</span>l.lockSession, leaderCh<span style="color: #d75f87;">)</span>

  <span style="color: #767676;">// </span><span style="color: #767676;">Set that we own the lock</span>
  l.isHeld = <span style="color: #d787af;">true</span>

  <span style="color: #767676;">// </span><span style="color: #767676;">Locked! All done</span>
  <span style="color: #d75f5f;">return</span> leaderCh, <span style="color: #d787af;">nil</span>
<span style="color: #008787;">}</span>
</pre>
</div>

<p>
unlock:
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #767676;">//</span><span style="color: #767676;">unlock&#25805;&#20316;&#27604;&#36739;&#31616;&#21333;</span>
<span style="color: #d75f5f;">func</span> <span style="color: #008787;">(</span>l *<span style="color: #d787af;">Lock</span><span style="color: #008787;">)</span> <span style="color: #ffaf00;">Unlock</span><span style="color: #008787;">()</span> <span style="color: #d787af;">error</span> <span style="color: #008787;">{</span>
  <span style="color: #767676;">// </span><span style="color: #767676;">Hold the lock as we try to release</span>
  l.l.<span style="color: #ffaf00;">Lock</span><span style="color: #d75f87;">()</span>
  <span style="color: #d75f5f;">defer</span> l.l.<span style="color: #ffaf00;">Unlock</span><span style="color: #d75f87;">()</span>

  <span style="color: #767676;">// </span><span style="color: #767676;">Ensure the lock is actually held</span>
  <span style="color: #d75f5f;">if</span> !l.isHeld <span style="color: #d75f87;">{</span>
    <span style="color: #d75f5f;">return</span> ErrLockNotHeld
  <span style="color: #d75f87;">}</span>

  <span style="color: #767676;">// </span><span style="color: #767676;">Set that we no longer own the lock</span>
  l.isHeld = <span style="color: #d787af;">false</span>

  <span style="color: #767676;">// </span><span style="color: #767676;">Stop the session renew</span>
  <span style="color: #767676;">// </span><span style="color: #767676;">&#20572;&#27490;&#24310;&#38271;session&#30340;&#26102;&#38388;</span>
  <span style="color: #d75f5f;">if</span> l.sessionRenew != <span style="color: #d787af;">nil</span> <span style="color: #d75f87;">{</span>
    <span style="color: #d75f5f;">defer</span> <span style="color: #d75f5f;">func</span><span style="color: #87af87;">()</span> <span style="color: #87af87;">{</span>
      <span style="color: #ff8700;">close</span><span style="color: #d75f00;">(</span>l.sessionRenew<span style="color: #d75f00;">)</span>
      l.sessionRenew = <span style="color: #d787af;">nil</span>
    <span style="color: #87af87;">}()</span>
  <span style="color: #d75f87;">}</span>

  <span style="color: #767676;">// </span><span style="color: #767676;">Get the lock entry, and clear the lock session</span>
  lockEnt := l.<span style="color: #ffaf00;">lockEntry</span><span style="color: #d75f87;">(</span>l.lockSession<span style="color: #d75f87;">)</span>
  l.lockSession = <span style="color: #afaf00;">""</span>

  <span style="color: #767676;">// </span><span style="color: #767676;">Release the lock explicitly</span>
  <span style="color: #767676;">//</span><span style="color: #767676;">&#30452;&#25509;&#35843;&#29992;release&#37322;&#25918;&#25481;lock</span>
  kv := l.c.<span style="color: #ffaf00;">KV</span><span style="color: #d75f87;">()</span>
  _, _, err := kv.<span style="color: #ffaf00;">Release</span><span style="color: #d75f87;">(</span>lockEnt, <span style="color: #d787af;">nil</span><span style="color: #d75f87;">)</span>
  <span style="color: #d75f5f;">if</span> err != <span style="color: #d787af;">nil</span> <span style="color: #d75f87;">{</span>
    <span style="color: #d75f5f;">return</span> fmt.<span style="color: #ffaf00;">Errorf</span><span style="color: #87af87;">(</span><span style="color: #afaf00;">"failed to release lock: %v"</span>, err<span style="color: #87af87;">)</span>
  <span style="color: #d75f87;">}</span>
  <span style="color: #d75f5f;">return</span> <span style="color: #d787af;">nil</span>
<span style="color: #008787;">}</span>

</pre>
</div>

<p>
从上可以看到consul的实现还是比较严谨的。比如不停的监视锁的占用者。比如在锁释放后才停止延长session的周期(这里要注意的是就算锁释放失败了也不代表你占用了锁，因为已经停止了session的刷新, 锁会被过期自动释放掉，所以最好是在调用之后不再使用互斥操作, 但是可以多次调用unlock)
</p>
</div>
</div>

<div id="outline-container-org0d90581" class="outline-2">
<h2 id="org0d90581"><span class="section-number-2">4</span> 参考资料</h2>
<div class="outline-text-2" id="text-4">
<p>
redis官方介绍: <a href="https://redis.io/topics/distlock">https://redis.io/topics/distlock</a>
reids分布式锁go实现: <a href="https://github.com/go-redsync/redsync">https://github.com/go-redsync/redsync</a>
consul信号量: <a href="https://www.consul.io/docs/guides/semaphore.html">https://www.consul.io/docs/guides/semaphore.html</a>
consul排他锁： <a href="https://www.consul.io/docs/guides/leader-election.html">https://www.consul.io/docs/guides/leader-election.html</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2018-08-18 六 12:41</p>
<p class="validation"></p>
</div>
</body>
</html>
